Revit 2024 API
TextListStyle Enumeration
 Supported styles of text list paragraphs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum TextListStyle
Visual Basic
Public Enumeration TextListStyle
Visual C++
public enum class TextListStyle
Members
Member name | Description
None |  Indicates that the paragraph is not a list.
Bullet |  Indicates a list that uses standard bullets.
NumberArabic |  Indicates a list that uses arabic numbers.
LetterLowercase |  Indicates a list that uses lowercase letters.
LetterUppercase |  Indicates a list that uses uppercase letters.
NumberRomanLowercase |  Indicates a list that uses lowercase Roman numbers.
NumberRomanUppercase |  Indicates a list that uses uppercase Roman numbers.
See Also
Autodesk.Revit.DB Namespace